import Hero from "@/components/Hero/Hero";
import styles from "./page.module.css";
import About from "@/components/About/About";
import Button from "@/components/Button/Button";
import PictureList from "@/components/pictureList/pictureList";

export default function Home() {
  const data = [
    {
      _id: {
        $oid: "68498236a100312bea045fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea045fe6.webp",
      title: "Національний парк «Деснянсько-Старогутський»: перлина Сумщини",
      article:
        "Національний природний парк «Деснянсько-Старогутський» — це мальовничий куточок Сумщини, де збереглися рідкісні види рослин і тварин. Його територія охоплює ліси, болота та долини річки Десни. Туристи можуть пройти екостежками, побачити гнізда чорного лелеки та послухати спів численних пташиних зграй. Парк відомий своєю тишею й атмосферою, що дозволяє повністю відпочити від міської метушні. Для відвідувачів облаштовані місця для кемпінгу, а місцеві гіди проводять пізнавальні екскурсії. Окрім природних багатств, парк має й культурне значення: тут можна побачити старовинні поселення та археологічні пам’ятки. «Деснянсько-Старогутський» — це перлина Полісся, яка відкриває красу й багатство української природи.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0be",
      },
      rate: 14,
      ownerId: {
        $oid: "6881563901add19ee16fd013",
      },
      date: "2025-09-20",
    },
    {
      _id: {
        $oid: "68498236a100312bea018fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea018fe6.webp",
      title: "Закарпатські винні тури: смак і природа",
      article:
        "Закарпаття відоме не лише своїми горами та замками, а й виноробними традиціями, які сягають століть. Винні тури — це чудова нагода поєднати подорож мальовничими краєвидами з дегустацією унікальних напоїв. Туристи відвідують винні підвали, де зберігаються колекції старовинних вин, слухають історії виноробів і відкривають для себе секрети виготовлення. Окрім вина, гостям пропонують сири, м’ясні делікатеси та закарпатські страви, які підкреслюють смак напоїв. Атмосфера винних турів наповнена затишком і культурою краю. Прогулянки виноградниками, знайомство з ремеслами й гостинність господарів роблять цю подорож незабутньою. Закарпатські винні тури — це поєднання гастрономічного задоволення, природи та культури, яке залишає яскраві враження.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0bb",
      },
      rate: 14,
      ownerId: {
        $oid: "6881563901add19ee16fd011",
      },
      date: "2025-09-10",
    },
    {
      _id: {
        $oid: "68498236a100312bea021fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea021fe6.webp",
      title: "Карпатські водоспади: чарівність живої води",
      article:
        "Карпати славляться своїми водоспадами, які стали справжніми перлинами зеленого туризму. Найвідомішими є Шипіт на Закарпатті, Пробій у Яремчі та Манявський водоспад на Івано-Франківщині. Кожен із них має свою красу та легенди. Влітку туристи насолоджуються прохолодою бризок і зеленими пейзажами довкола, а взимку водоспади перетворюються на крижані скульптури. Дорога до них часто проходить мальовничими стежками, де можна побачити лісових мешканців і вдихнути аромат хвойних дерев. Для фотографів це справжній рай, адже світло й вода створюють унікальні композиції. Місцеві садиби пропонують туристам не лише відпочинок, а й знайомство з традиційною кухнею — грибною юшкою, банушем чи карпатським чаєм. Подорожуючи до водоспадів, кожен отримує заряд енергії й натхнення, адже вода в Карпатах символізує силу та чистоту природи.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0bd",
      },
      rate: 14,
      ownerId: {
        $oid: "6881563901add19ee16fd011",
      },
      date: "2025-09-23",
    },
    {
      _id: {
        $oid: "68498236a100312bea007fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea007fe6.webp",
      title: "Еко-ферми Поділля: смак натурального відпочинку",
      article:
        "Поділля славиться не лише своїми краєвидами, а й гостинними еко-фермами, які пропонують мандрівникам зануритися у світ натурального господарства. Тут туристи можуть не просто відпочити, а й взяти участь у зборі врожаю, догляді за тваринами чи приготуванні традиційних страв. Еко-ферми Поділля — це нагода скуштувати молочні продукти, виготовлені вручну, свіжий хліб з печі або мед прямо з пасіки. Окрім гастрономічної складової, ферми часто організовують майстер-класи з ремесел, наприклад гончарства чи ткацтва. Такі подорожі дозволяють відчути справжній смак життя в гармонії з природою, а також підтримати місцевих виробників. Для сімейного відпочинку еко-ферми стають особливо привабливими: діти мають змогу поспілкуватися з тваринами, навчитися чомусь новому та провести час на свіжому повітрі. Подорожуючи Поділлям, варто відвідати кілька фермерських господарств, адже кожне з них має свою унікальну історію та пропозиції для гостей.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0bb",
      },
      rate: 16,
      ownerId: {
        $oid: "6881563901add19ee16fd011",
      },
      date: "2025-08-24",
    },
    {
      _id: {
        $oid: "68498236a100312bea043fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea043fe6.webp",
      title: "Еко-тури на Рівненщині: від поліських лісів до бурштинових озер",
      article:
        "Рівненщина — це край, де природа зберегла свою первозданну красу. Поліські ліси, річки й озера створюють чудові умови для еко-туризму. Особливою популярністю користуються бурштинові озера, які виникли після розробки покладів і сьогодні вражають своїм блакитним кольором. Туристи можуть відвідати екостежки в Поліському природному заповіднику, де мешкають рідкісні птахи й звірі. У селах Рівненщини мандрівників пригощають поліськими стравами: кулішем, грибною юшкою чи узваром. Тут також можна побачити традиційні ремесла — лозоплетіння та виготовлення дерев’яних виробів. Рівненщина — це місце, де відпочинок поєднується з тишею та можливістю відчути гармонію з природою. Еко-тури цим регіоном стають чудовим вибором для тих, хто прагне спокою й нових вражень.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0c1",
      },
      rate: 16,
      ownerId: {
        $oid: "6881563901add19ee16fcffb",
      },
      date: "2025-09-19",
    },
    {
      _id: {
        $oid: "68498236a100312bea038fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea038fe6.webp",
      title: "Подорожі Тисою: мальовнича річка Закарпаття",
      article:
        "Тиса — одна з найбільших річок Закарпаття, яка є справжнім символом цього регіону. Її береги вкриті густими лісами та зеленими луками, що створюють мальовничі краєвиди. Подорожі Тисою популярні серед любителів водного туризму: сплави на байдарках чи катамаранах дарують відчуття пригоди та близькості до природи. Річка також відома своєю риболовлею, адже тут водяться коропи, щуки й інші види риб. Уздовж Тиси розташовані затишні села, де туристів пригощають традиційними закарпатськими стравами та вином. Особливу атмосферу створюють заходи сонця над річкою, які залишають незабутні враження. Подорож Тисою — це можливість побачити Закарпаття з іншого боку, насолодитися його природною красою та відчути гармонію з навколишнім світом.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0c0",
      },
      rate: 17,
      ownerId: {
        $oid: "6881563901add19ee16fd002",
      },
      date: "2025-09-13",
    },
    {
      _id: {
        $oid: "68498236a100312bea011fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea011fe6.webp",
      title: "Традиції гуцулів: мандрівка у світ автентики",
      article:
        "Гуцульщина — це край, де природа й культура створюють неповторний симбіоз. Подорожуючи селами Карпат, туристи мають змогу відчути дух стародавніх традицій, які збереглися до сьогодні. Гуцули відомі своєю гостинністю, барвистими костюмами та неповторною музикою, що супроводжує кожне свято. Особливе місце займає різьбярство по дереву та виготовлення кераміки, які передаються від покоління до покоління. Туристи можуть відвідати майстер-класи, щоб власноруч створити сувенір на пам’ять. Автентичні страви — бануш із бринзою, грибна юшка чи карпатський мед — стають справжньою кулінарною подорожжю. Гуцульські весілля, Різдвяні та Великодні обряди вражають колоритом і глибиною. Мандрівка Гуцульщиною дозволяє не лише побачити красу Карпатських гір, а й відкрити для себе унікальний світ, де традиції є живою частиною щоденного життя. Це подорож у часі, яка залишає яскраві враження й надихає цінувати спадщину.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0bc",
      },
      rate: 16,
      ownerId: {
        $oid: "6881563901add19ee16fd011",
      },
      date: "2025-08-29",
    },
    {
      _id: {
        $oid: "68498236a100312bea041fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea041fe6.webp",
      title: "Подільські винні тури: смак традицій",
      article:
        "Поділля славиться не лише своїми замками й природними красотами, а й виноробними традиціями, що сягають кількох століть. Винні тури цим краєм дарують можливість відвідати старовинні винні підвали, скуштувати місцеві вина та дізнатися про секрети їх виготовлення. Господарі охоче діляться історіями про родинні традиції виноробства, пропонують сири, мед і домашні страви. Подорожуючи винними маршрутами, туристи насолоджуються також краєвидами Поділля: пагорбами, річками й селами з автентичною архітектурою. Винні тури — це поєднання гастрономічного задоволення, культурного досвіду та зеленого відпочинку. Подільські вина стають не лише смаком, а й символом цього регіону, що залишається в пам’яті надовго.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0bb",
      },
      rate: 13,
      ownerId: {
        $oid: "6881563901add19ee16fcffc",
      },
      date: "2025-09-17",
    },
    {
      _id: {
        $oid: "68498236a100312bea036fe6",
      },
      img: "https://ftp.goit.study/img/green-tourism/68498236a100312bea036fe6.webp",
      title: "Еко-ферми Карпат: життя серед природи",
      article:
        "Карпати — це не лише гори та ліси, а й місце розвитку еко-фермерства, яке стає все більш популярним серед туристів. Еко-ферми пропонують мандрівникам можливість пожити серед природи, спробувати натуральні продукти та дізнатися більше про традиційне господарство. Тут можна скуштувати свіжу бринзу, молоко, домашній хліб і мед. Господарі часто організовують для гостей майстер-класи з приготування страв чи догляду за тваринами. Еко-ферми Карпат — це також ідеальне місце для дітей, які можуть побачити, як працюють на фермі, та поспілкуватися з тваринами. Крім гастрономічних вражень, туристів приваблюють мальовничі краєвиди, чисте повітря та можливість відпочити від міського шуму. Подорожуючи Карпатами, варто зупинитися на кілька днів на фермі, щоб відчути гармонію з природою.",
      category: {
        $oid: "6966a5cdbc1b90f344c2e0bb",
      },
      rate: 17,
      ownerId: {
        $oid: "6881563901add19ee16fd011",
      },
      date: "2025-09-11",
    },
  ];

  return (
    <main className={styles.main}>
      <Hero />
      <About />
    </main>
  );
}
